src/main/resources/login.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <Login xmlns="com/majorczyk/soap/account">
      <login>user1</login>
      <password>user1</password>
    </Login>
  </Body>
</Envelope>
